openwch/ch32x315/EVT/EXAM/USBHS/Device/CH372Device/User/ch32x315_usbhs_device.c
                    /* errflag = 0xFF means a request not support or some errors occurred, else correct */
                    if(errflag == 0xFF)
                    {
                        /* if one request not support, return stall */
                        USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_STALL;
                        USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_STALL;
                    }
                    else
                    {
                        /* end-point 0 data Tx/Rx */
                        if(USBHS_SetupReqType & DEF_UEP_IN)
                        {
                            /* tx */
                            len = (USBHS_SetupReqLen > DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                            USBHS_SetupReqLen -= len;
                            USBHSD->UEP0_TX_LEN = len;
                            USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                        }
                        else
                        {
                            /* rx */
                            if(USBHS_SetupReqLen == 0)
                            {
                                USBHSD->UEP0_TX_LEN = 0;
                                USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                            }
                            else
                            {
                                USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
                            }
                        }
                    }
                }
                /* end-point 0 data out interrupt */
                else
                {
                    USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_RES_NAK;  // clear
                    len = USBHSD->UEP0_RX_LEN;

                    /* if any processing about rx, set it here */
                    if((USBHS_SetupReqType & USB_REQ_TYP_MASK) != USB_REQ_TYP_STANDARD)
                    {
                        USBHS_SetupReqLen = 0;
                        /* Non-standard request end-point 0 Data download */
                        if(USBHS_SetupReqCode == CDC_SET_LINE_CODING)
                        {
                        }
                    }
                    else
                    {
                        /* Standard request end-point 0 Data download */
                    }

                    if(USBHS_SetupReqLen == 0)
                    {
                        USBHSD->UEP0_TX_LEN = 0;
                        USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_TOG_DATA1 | USBHS_UEP_T_RES_ACK;
                    }
                }
                USBHSD->UEP0_RX_CTRL &= ~USBHS_UEP_R_DONE;
                break;
            /* end-point 1 data out interrupt */
            case DEF_UEP1:
                if(USBHSD->UEP1_RX_CTRL & USBHS_UEP_R_TOG_MATCH)
                {
                    /* Write In Buffer */
                    USBHSD->UEP1_RX_CTRL ^= USBHS_UEP_R_TOG_DATA1;
                    RingBuffer_Comm.PackLen[RingBuffer_Comm.LoadPtr] = USBHSD->UEP1_RX_LEN;
                    RingBuffer_Comm.LoadPtr++;
                    if(RingBuffer_Comm.LoadPtr == DEF_Ring_Buffer_Max_Blks)
                    {
                        RingBuffer_Comm.LoadPtr = 0;
                    }
                    USBHSD->UEP1_RX_DMA = (uint32_t)(&Data_Buffer[(RingBuffer_Comm.LoadPtr) * DEF_USBD_HS_PACK_SIZE]);
                    RingBuffer_Comm.RemainPack++;
                    if(RingBuffer_Comm.RemainPack >= DEF_Ring_Buffer_Max_Blks - DEF_RING_BUFFER_REMINE)
                    {
                        USBHSD->UEP1_RX_CTRL = ((USBHSD->UEP1_RX_CTRL) & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_NAK;
                        RingBuffer_Comm.StopFlag = 1;
                    }
                    else
                    {
                        USBHSD->UEP1_RX_CTRL = ((USBHSD->UEP1_RX_CTRL) & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_ACK;
                    }
                }
                USBHSD->UEP1_RX_CTRL &= ~USBHS_UEP_R_DONE;
                break;

            /* end-point 3 data out interrupt */
            case DEF_UEP3:
                if(USBHSD->UEP3_RX_CTRL & USBHS_UEP_R_TOG_MATCH)
                {
                    len = (uint16_t)(USBHSD->UEP3_RX_LEN);
                    USBHSD->UEP3_RX_CTRL ^= USBHS_UEP_R_TOG_DATA1;
                    USBHSD->UEP3_RX_CTRL = ((USBHSD->UEP3_RX_CTRL) & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_NAK;
                    for(i = 0; i < len; i++)
                    {
                        USBHS_EP4_Tx_Buf[i] = ~USBHS_EP3_Rx_Buf[i];
                    }
                    USBHSD->UEP4_TX_LEN = len;
                    USBHSD->UEP4_TX_CTRL = (USBHSD->UEP4_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_ACK;
                }
                USBHSD->UEP3_RX_CTRL &= ~USBHS_UEP_R_DONE;
                break;

            /* end-point 5 data out interrupt */
            case DEF_UEP5:
                if(USBHSD->UEP5_RX_CTRL & USBHS_UEP_R_TOG_MATCH)
                {
                    len = (uint16_t)(USBHSD->UEP5_RX_LEN);
                    USBHSD->UEP5_RX_CTRL ^= USBHS_UEP_R_TOG_DATA1;
                    USBHSD->UEP5_RX_CTRL = ((USBHSD->UEP5_RX_CTRL) & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_NAK;
                    for(i = 0; i < len; i++)
                    {
                        USBHS_EP6_Tx_Buf[i] = ~USBHS_EP5_Rx_Buf[i];
                    }
                    USBHSD->UEP6_TX_LEN = len;
                    USBHSD->UEP6_TX_CTRL = (USBHSD->UEP6_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_ACK;
                }
                USBHSD->UEP5_RX_CTRL &= ~USBHS_UEP_R_DONE;
                break;

            default:
                errflag = 0xFF;
                break;
            }
        }
        else
        {
            /* data-in stage processing */
            switch(endp_num)
            {
            /* end-point 0 data in interrupt */
            case DEF_UEP0:
                if(USBHS_SetupReqLen == 0)
                {
                    USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
                }
                if((USBHS_SetupReqType & USB_REQ_TYP_MASK) != USB_REQ_TYP_STANDARD)
                {
                    /* Non-standard request endpoint 0 Data upload */
                }
                else
                {
                    /* Standard request endpoint 0 Data upload */
                    switch(USBHS_SetupReqCode)
                    {
                    case USB_GET_DESCRIPTOR:
                        len = USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                        memcpy(USBHS_EP0_Buf, pUSBHS_Descr, len);
                        USBHS_SetupReqLen -= len;
                        pUSBHS_Descr += len;
                        USBHSD->UEP0_TX_LEN = len;
                        USBHSD->UEP0_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                        USBHSD->UEP0_TX_CTRL = (USBHSD->UEP0_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_ACK;  // clear
                        break;

                    case USB_SET_ADDRESS:
                        USBHSD->DEV_AD = USBHS_DevAddr;
                        break;

                    default:
                        USBHSD->UEP0_TX_LEN = 0;
                        break;
                    }
                }

