openwch/ch32x315/EVT/EXAM/USBHS/Device/CH372Device/User/ch32x315_usbhs_device.c
                /* test mode */
                if(USBHS_Test_Flag & 0x80)
                {
                    USB_TestMode_Deal();
                }
                USBHSD->UEP0_TX_CTRL &= ~USBHS_UEP_T_DONE;
                break;

            /* end-point 1 data in interrupt */
            case DEF_UEP1:
                USBHSD->UEP1_TX_CTRL = (USBHSD->UEP1_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                USBHSD->UEP1_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                USBHSD->UEP1_TX_CTRL &= ~USBHS_UEP_T_DONE;
                break;

            /* end-point 4 data in interrupt */
            case DEF_UEP4:
                USBHSD->UEP4_TX_CTRL = (USBHSD->UEP4_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                USBHSD->UEP4_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                USBHSD->UEP3_RX_CTRL = (USBHSD->UEP3_RX_CTRL & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_ACK;
                USBHSD->UEP4_TX_CTRL &= ~USBHS_UEP_T_DONE;
                break;

            /* end-point 6 data in interrupt */
            case DEF_UEP6:
                USBHSD->UEP6_TX_CTRL = (USBHSD->UEP6_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_NAK;
                USBHSD->UEP6_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;
                USBHSD->UEP5_RX_CTRL = (USBHSD->UEP5_RX_CTRL & ~USBHS_UEP_R_RES_MASK) | USBHS_UEP_R_RES_ACK;
                USBHSD->UEP6_TX_CTRL &= ~USBHS_UEP_T_DONE;
                break;

            default:
                break;
            }
        }
    }
    else if(intflag & USBHS_UDIF_LINK_RDY)
    {
        USBHSD->INT_FG = USBHS_UDIF_LINK_RDY;
    }
    else if(intflag & USBHS_UDIF_SUSPEND)
    {
        USBHSD->INT_FG = USBHS_UDIF_SUSPEND;
        /* usb suspend interrupt processing */
        if(USBHSD->MIS_ST & USBHS_UDMS_SUSPEND)
        {
            USBHS_DevSleepStatus |= 0x02;
            if(USBHS_DevSleepStatus == 0x03)
            {
                /* Handling usb sleep here */
            }
        }
        else
        {
            USBHS_DevSleepStatus &= ~0x02;
        }
    }
    else if(intflag & USBHS_UDIF_BUS_RST)
    {
        /* usb reset interrupt processing */
        if(!(RCC->CTLR & RCC_HSERDY))
        {
            USBHSI->HSI_CAL_CR &= ~USBHSI_SFT_RST;
        }        
        USBHS_DevConfig = 0;
        USBHS_DevAddr = 0;
        USBHS_DevSleepStatus = 0;
        USBHS_DevEnumStatus = 0;

        USBHSD->DEV_AD = 0;
        USBHS_Device_Endp_Init();
        USBHSD->INT_FG = USBHS_UDIF_BUS_RST;
    }
    else
    {
        /* other interrupts */
        USBHSD->INT_FG = intflag;
    }
}
